{"compress":true,"commitItems":[["a5b8025c-7be2-41d6-bdf9-4e76668e3468",1548681346698,"---\n\ntitle: 《模型开发、评估、应用导则》批注：第四章(9)\n\ntags: 1000天持续行动,GDEA\n\ndate:   2019-1-28\n\n---\n\n·[499]|1000天行动计划\n\n**读书笔记**/热点追踪/论文研读/教程手册\n\n![封面](http://comieswater-1254012817.cossh.myqcloud.com/comieswater/1534259099598.png)\n\n\n\n\t本节速读：本节主要说明了在专有模型（代码未公开）应用时如何进行评估，并且简单叙述了如何从过往案例中获取经验。\n\n\t\n\n\n\n## 4.3 专有模型评价\n\n\n\n本导则定义专有模型是源代码并没有广泛的公开的计算机模型。为了推动决策的透明，EPA 在有开源模型时会尽可能选择开源模型。但是，如果使用专有模型能够提供更加可靠和更好的模拟时，相关部门也接受专有模型。\n\n\n\n>This guidance defines proprietary models as those computer models for which the source code is not universally shared. To promote the transparency with which decisions are made, EPA prefers using non- proprietary models when available. However, the Agency acknowledges there will be times when the use of proprietary models provides the most reliable and best-accepted characterization of a system.\n\n\n\n在应用专有模型时，应有全面、完善的公开的文档，文档包括：\n\n- 概念模型和模型基于的理论基础（节3.3.1 描述的）。\n\n- 验证专有模型没有数值求解问题或bug和其能够充分的呈现概念模型的技术和程序（节 3.3.3）。\n\n- 用于评估模型的过程(如第4.2节所述)以及得出最后结论的基础，即模型及其分析结果的质量足以支撑决策(如第4.1节所述)。\n\n- 在尽可能的范围内，能够接触输入数据和输出数据的第三方能够复现模型的结果。\n\n>When a proprietary model is used, its use should be accompanied by comprehensive, publicly available documentation. This documentation should describe:\n\n• The conceptual model and the theoretical basis (as described in Section 3.3.1) for the model.\n\n• The techniques and procedures used to verify that the proprietary model is free from numerical problems or “bugs” and that it truly represents the conceptual model (as described in Section 3.3.3).\n\n• The process used to evaluate the model (as described in Section 4.2) and the basis for concluding that the model and its analytical results are of a quality sufficient to serve as the basis for a decision (as described in Section 4.1).\n\n• To the extent practicable, access to input and output data such that third parties can replicate the model results.\n\n\n\n---\n\n\n\n## 4.4 从过往经验中学习-复盘模型的分析\n\n\n\nNRC 的模型委员会在『管理决策过程』中强调了在进行模型评估过程中最后一个重要的问题是要从之前模型吸取经验。模型的复盘分析对于单个模型以及管理政策和系统的拓展模型的应用领域是极其重要的。委员会强调了复盘分析能从以下视角考虑：\n\n\n\n1. 能够研究系统的优点和缺点，这些是所有类别模型（例如，地下水模型，地表水模型，空气污染模型和健康风险模型）所具备的特点。例如，学者估计大约有20-30%的地下水模型研究中的奇异结果都是因为计算模型的概念模型是不合理的（Bredehoeft 2003,2005 in NRC 2007)。\n\n2. 能够分析模型成功应用的案例过程（例如，模型开发和评估的方法）。\n\n3. 能够检查那些运行多年的模型，查看其表现如何。模型评价过程不吻合的异常数据，特别是在非常规条件下获取的数据，提供了区分和修正概念模型误差的机会。这种分析是指模型的后评估（见5.5节）。\n\n\n\n单个模型的评价的复盘结果和模型类别能被用于区分提升模型表现的特征。\n\n\n\n>>The NRC Committee on Models in the Regulatory Decision Process emphasized that the final issue in managing the model evaluation process is the learning that comes from examining prior modeling experiences. Retrospective analysis of models is important to individual models and regulatory policies and to systematically enhance the overall modeling field. The committee pointed out that retrospective analyses can be considered from various perspectives:\n\n \n\n>They can investigate the systematic strengths and weaknesses that are characteristic of broad classes of models — for example, models of ground water flow, surface water, air pollution, and health risks assessment. For example, a researcher estimated that in 20 to 30 percent of ground water modeling efforts, surprising occurrences indicated that the conceptual model underlying the computer model was invalid (Bredehoeft 2003, 2005, in NRC 2007).\n\n\n\n>They can study the processes (for example, approaches to model development and evaluation) that lead to successful model applications.\n\n\n\n>They can examine models that have been in use for years to determine how well they work. Ongoing evaluation of the model against data, especially data taken under novel conditions, offers the best chance to identify and correct conceptual errors. This type of analysis is referred to as a model “post- audit” (see Section 5.5)\n\n \n\n>The results of retrospective evaluations of individual models and model classes can be used to identify priorities for improving models.\n\n\n\n\n\n参考文献：\n\n[1] Gaber N, Foley G, Pascual P, et al. Guidance on the development, evaluation, and application of environmental models[J]. Report, Council for Regulatory Environmental Modeling, 2009, 81.\n\n\n\n\n\n![页尾](http://comieswater-1254012817.cossh.myqcloud.com/页尾识别new-2017-09-22.png)\n\n微信公众号 | 水环境编Cheng长\n\n网          站 | comieswater.com\n\n\n\n\n\n![赞赏我](http://comieswater-1254012817.cossh.myqcloud.com/IMG_3077.JPG)\n\n\n\n2019-1-28\n\n\n\n",[[1548681295117,["fanqi@COMIES-T410",[[-1,215,"\t本节速读：本节主要说明了在专有模型（代码未公开）应用时如何进行评估，并且简单叙述了如何从过往案例中获取经验。\n\n\t\n\n\n\n## 4.3 专有模型评价\n\n\n\n本导则定义专有模型是源代码并没有广泛的公开的计算机模型。为了推动决策的透明，EPA 在有开源模型时会尽可能选择开源模型。但是，如果使用专有模型能够提供更加可靠和更好的模拟时，相关部门也接受专有模型。\n\n\n\n>This guidance defines proprietary models as those computer models for which the source code is not universally shared. To promote the transparency with which decisions are made, EPA prefers using non- proprietary models when available. However, the Agency acknowledges there will be times when the use of proprietary models provides the most reliable and best-accepted characterization of a system.\n\n\n\n在应用专有模型时，应有全面、完善的公开的文档，文档包括：\n\n- 概念模型和模型基于的理论基础（节3.3.1 描述的）。\n\n- 验证专有模型没有数值求解问题或bug和其能够充分的呈现概念模型的技术和程序（节 3.3.3）。\n\n- 用于评估模型的过程(如第4.2节所述)以及得出最后结论的基础，即模型及其分析结果的质量足以支撑决策(如第4.1节所述)。\n\n- 在尽可能的范围内，能够接触输入数据和输出数据的第三方能够复现模型的结果。\n\n>When a proprietary model is used, its use should be accompanied by comprehensive, publicly available documentation. This documentation should describe:\n\n• The conceptual model and the theoretical basis (as described in Section 3.3.1) for the model.\n\n• The techniques and procedures used to verify that the proprietary model is free from numerical problems or “bugs” and that it truly represents the conceptual model (as described in Section 3.3.3).\n\n• The process used to evaluate the model (as described in Section 4.2) and the basis for concluding that the model and its analytical results are of a quality sufficient to serve as the basis for a decision (as described in Section 4.1).\n\n• To the extent practicable, access to input and output data such that third parties can replicate the model results.\n\n\n\n---\n\n\n"]],[213,1831],[213,213]]],[1548681297660,["fanqi@COMIES-T410",[[-1,215,"\n"]],[215,215],[214,214]]],[1548681297962,["fanqi@COMIES-T410",[[-1,214,"\n"]],[214,214],[213,213]]],[1548681300053,["fanqi@COMIES-T410",[[-1,213,"\n"]],[213,213],[212,212]]]],null,"fanqi@COMIES-T410"]]}